ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/timer_a.xml
<module id="Timer_A" HW_revision=""><register id="CTL" width="16" offset="0x0" internal="0" description="TimerAx Control Register"><bitfield id="IFG" description="TimerA interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="IFG__0" value="0" description="No interrupt pending"/><bitenum id="IFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="IE" description="TimerA interrupt enable" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="IE__0" value="0" description="Interrupt disabled"/><bitenum id="IE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="CLR" description="TimerA clear" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="MC" description="Mode control" begin="5" end="4" width="2" rwaccess="R/W"><bitenum id="MC__0" value="0" description="Stop mode: Timer is halted"/><bitenum id="MC__1" value="1" description="Up mode: Timer counts up to TAxCCR0"/><bitenum id="MC__2" value="2" description="Continuous mode: Timer counts up to 0FFFFh"/><bitenum id="MC__3" value="3" description="Up/down mode: Timer counts up to TAxCCR0 then down to 0000h"/></bitfield><bitfield id="ID" description="Input divider" begin="7" end="6" width="2" rwaccess="R/W"><bitenum id="ID__0" value="0" description="/1"/><bitenum id="ID__1" value="1" description="/2"/><bitenum id="ID__2" value="2" description="/4"/><bitenum id="ID__3" value="3" description="/8"/></bitfield><bitfield id="SSEL" description="TimerA clock source select" begin="9" end="8" width="2" rwaccess="R/W"><bitenum id="SSEL__0" value="0" description="TAxCLK"/><bitenum id="SSEL__1" value="1" description="ACLK"/><bitenum id="SSEL__2" value="2" description="SMCLK"/><bitenum id="SSEL__3" value="3" description="INCLK"/></bitfield></register><register id="CCTL0" width="16" offset="0x2" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL1" width="16" offset="0x4" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL2" width="16" offset="0x6" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL3" width="16" offset="0x8" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL4" width="16" offset="0xA" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL5" width="16" offset="0xC" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="CCTL6" width="16" offset="0xE" internal="0" description="Timer_A Capture/Compare Control Register"><bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="CCIFG__0" value="0" description="No interrupt pending"/><bitenum id="CCIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="COV__0" value="0" description="No capture overflow occurred"/><bitenum id="COV__1" value="1" description="Capture overflow occurred"/></bitfield><bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="OUT__0" value="0" description="Output low"/><bitenum id="OUT__1" value="1" description="Output high"/></bitfield><bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="CCIE__0" value="0" description="Interrupt disabled"/><bitenum id="CCIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W"><bitenum id="OUTMOD__0" value="0" description="OUT bit value"/><bitenum id="OUTMOD__1" value="1" description="Set"/><bitenum id="OUTMOD__2" value="2" description="Toggle/reset"/><bitenum id="OUTMOD__3" value="3" description="Set/reset"/><bitenum id="OUTMOD__4" value="4" description="Toggle"/><bitenum id="OUTMOD__5" value="5" description="Reset"/><bitenum id="OUTMOD__6" value="6" description="Toggle/set"/><bitenum id="OUTMOD__7" value="7" description="Reset/set"/></bitfield><bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="CAP__0" value="0" description="Compare mode"/><bitenum id="CAP__1" value="1" description="Capture mode"/></bitfield><bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="SCS__0" value="0" description="Asynchronous capture"/><bitenum id="SCS__1" value="1" description="Synchronous capture"/></bitfield><bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W"><bitenum id="CCIS__0" value="0" description="CCIxA"/><bitenum id="CCIS__1" value="1" description="CCIxB"/><bitenum id="CCIS__2" value="2" description="GND"/><bitenum id="CCIS__3" value="3" description="VCC"/></bitfield><bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="No capture"/><bitenum id="CM__1" value="1" description="Capture on rising edge"/><bitenum id="CM__2" value="2" description="Capture on falling edge"/><bitenum id="CM__3" value="3" description="Capture on both rising and falling edges"/></bitfield></register><register id="R" width="16" offset="0x10" internal="0" description="TimerA register"/><register id="CCR0" width="16" offset="0x12" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR1" width="16" offset="0x14" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR2" width="16" offset="0x16" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR3" width="16" offset="0x18" i