ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/timer_a.xml
nternal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR4" width="16" offset="0x1A" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR5" width="16" offset="0x1C" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="CCR6" width="16" offset="0x1E" internal="0" description="Timer_A Capture/Compare  Register"><bitfield id="R" description="TimerA register. The TAxR register is the count of TimerA." begin="15" end="0" width="16" rwaccess="R/W"/></register><register id="EX0" width="16" offset="0x20" internal="0" description="TimerAx Expansion 0 Register"><bitfield id="IDEX" description="Input divider expansion" begin="2" end="0" width="3" rwaccess="R/W"><bitenum id="IDEX__0" value="0" description="Divide by 1"/><bitenum id="IDEX__1" value="1" description="Divide by 2"/><bitenum id="IDEX__2" value="2" description="Divide by 3"/><bitenum id="IDEX__3" value="3" description="Divide by 4"/><bitenum id="IDEX__4" value="4" description="Divide by 5"/><bitenum id="IDEX__5" value="5" description="Divide by 6"/><bitenum id="IDEX__6" value="6" description="Divide by 7"/><bitenum id="IDEX__7" value="7" description="Divide by 8"/></bitfield></register><register id="IV" width="16" offset="0x2E" internal="0" description="TimerAx Interrupt Vector Register"><bitfield id="IV" description="TimerA interrupt vector value" begin="15" end="0" width="16" rwaccess="R/W"><bitenum id="IV__0" value="0" description="No interrupt pending"/><bitenum id="IV__2" value="2" description="Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CC"/><bitenum id="IV__4" value="4" description="Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CC"/><bitenum id="IV__6" value="6" description="Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CC"/><bitenum id="IV__8" value="8" description="Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CC"/><bitenum id="IV__16" value="10" description="Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CC"/><bitenum id="IV__18" value="12" description="Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CC"/><bitenum id="IV__20" value="14" description="Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG;"/></bitfield></register></module>